extends Node

func 伤害(伤害量 : float , 攻击来源 : Node , 攻击目标 : Node) ->void :
	if 攻击目标.当前护盾容量 > 0:
		pass
	elif 攻击目标.当前装甲容量 > 0:
		装甲受击(伤害量 , 攻击来源 , 攻击目标)

func 装甲受击(伤害 : float , 攻击来源 : Node , 攻击目标 : Node) -> void:
	if 攻击目标.穿甲抗性 * 2 < 攻击来源:
		核心受击(伤害 , 攻击目标)
	elif 攻击目标.穿甲抗性 < 攻击来源.穿甲指数:
		攻击目标.装甲容量 -= (攻击目标.穿甲抗性/攻击来源.穿甲指数) * 伤害
		核心受击((1 - (攻击目标.穿甲抗性/攻击来源.穿甲指数)) * 伤害 , 攻击目标)
	elif  攻击目标.穿甲抗性 > 攻击来源.穿甲指数:
		攻击目标.装甲容量 -= 伤害
	elif 攻击目标.穿甲抗性 > 攻击来源.穿甲指数 * 2:
		攻击目标.装甲容量 -= 伤害 * 0.5

func 核心受击(伤害 : float , 攻击目标 : Node) -> void:
	攻击目标.核心容量 -= 伤害
	攻击目标.死亡检查()
